903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/usart.c
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>
#include <stdio.h>
#include "usart.h"

#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
											
#define __usart_get_irqn(USARTx)	(	USARTx == USART1 ? USART1_IRQn : \
										USARTx == USART2 ? USART2_IRQn : \
										USARTx == USART3 ? USART3_IRQn : \
										USARTx == UART4 ? UART4_IRQn : \
										USARTx == UART5 ? UART5_IRQn : \
										(int)0	)
											
#define __usart_get_index(USARTx)	(	USARTx == USART1 ? 0 : \
										USARTx == USART2 ? 1 : \
										USARTx == USART3 ? 2 : \
										USARTx == UART4 ? 3 : \
										USARTx == UART5 ? 4 : \
										(int)-1	)
										
#define	__usart_config_clock_enable(USARTx)	{	if (USARTx == USART1)		{RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);} \
												else if (USARTx == USART2)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);} \
												else if (USARTx == USART3)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);} \
												else if (USARTx == UART4)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);} \
												else if (USARTx == UART5)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);} \
												else						{usart_log("usart clock no enable\r\n");} \
											}

#define	__usart_config_gpio_clock_enable(port)	{	if (port == GPIOA)		{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);} \
													else if (port == GPIOB)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);} \
													else if (port == GPIOC)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);} \
													else if (port == GPIOD)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);} \
													else if (port == GPIOE)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE);} \
													else if (port == GPIOF)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOF, ENABLE);} \
													else if (port == GPIOG)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOG, ENABLE);} \
													else					{usart_log("usart gpio clock no enable\r\n");} \
												}

#define	__usart_config_dma_clock_enable(USARTx)	{	if (USARTx == USART1)		{RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);} \
													else if (USARTx == USART2)	{RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);} \
													else if (USARTx == USART3)	{RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);} \
													else if (USARTx == UART4)	{RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);} \
													else						{usart_log("usart clock no enable\r\n");} \
												}

#define	__usart_config_io_af_pp(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_InitStructure.GPIO_Pin = pin ; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define	__usart_config_io_in_pu(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_InitStructure.GPIO_Pin = pin ; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#elif defined(STM32F40_41xxx)
											
#define __usart_get_irqn(USARTx)	(	USARTx == USART1 ? USART1_IRQn : \
										USARTx == USART2 ? USART2_IRQn : \
										USARTx == USART3 ? USART3_IRQn : \
										USARTx == UART4 ? UART4_IRQn : \
										USARTx == UART5 ? UART5_IRQn : \
										USARTx == USART6 ? USART6_IRQn : \
										(int)0	)
											
#define __usart_get_index(USARTx)	(	USARTx == USART1 ? 0 : \
										USARTx == USART2 ? 1 : \
										USARTx == USART3 ? 2 : \
										USARTx == UART4 ? 3 : \
										USARTx == UART5 ? 4 : \
										USARTx == USART6 ? 5 : \
										(int)-1	)
										
#define	__usart_config_clock_enable(USARTx)	{	if (USARTx == USART1)		{RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);} \
												else if (USARTx == USART2)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);} \
												else if (USARTx == USART3)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);} \
												else if (USARTx == UART4)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);} \
												else if (USARTx == UART5)	{RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);} \
												else if (USARTx == USART6)	{RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);} \
												else						{usart_log("usart clock no enable\r\n");} \
											}

#define	__usart_config_gpio_clock_enable(port)	{	if (port == GPIOA)		{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);} \
													else if (port == GPIOB)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);} \
													else if (port == GPIOC)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);} \
													else if (port == GPIOD)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);} \
													else if (port == GPIOE)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);} \
													else if (port == GPIOF)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);} \
													else if (port == GPIOG)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);} \
													else					{usart_log("usart gpio clock no enable\r\n");} \
												}

#define	__usart_config_dma_clock_enable(USARTx)	{	if (USARTx == USART1)		{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);} \
													else if (USARTx == USART2)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);} \
													else if (USARTx == USART3)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);} \
													else if (USARTx == UART4)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);} \
													else if (USARTx == UART5)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);} \
													else if (USARTx == USART6)	{RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);} \
													else						{usart_log("usart clock no enable\r\n");} \
												}

#define	__usart_config_io_af_pp(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF; \
												GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; \
												GPIO_InitStructure.GPIO_Pin = pin; \
												GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define	__usart_config_io_in_pu(port, pin)	{	GPIO_InitTypeDef GPIO_InitStructure; \
												GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN; \
												GPIO_InitStructure.GPIO_Pin = pin; \
												GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; \
												GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; \
												GPIO_Init(port, &GPIO_InitStructure); \
											}

#define __usart_get_dma_stream(usartx)	(	usartx == USART1 ? DMA2_Stream5 : \
											usartx == USART2 ? DMA1_Stream5 : \
											usartx == USART3 ? DMA1_Stream1 : \
											usartx == UART4 ? DMA1_Stream2 : \
											usartx == UART5 ? DMA1_Stream0 : \
											usartx == USART6 ? DMA2_Stream1 : \
											(int)0)

#define	__usart_get_dma_channel(usartx)		(	usartx == USART1 ? DMA_Channel_4 : \
												usartx == USART2 ? DMA_Channel_4 : \
												usartx == USART3 ? DMA_Channel_4 : \
												usartx == UART4 ? DMA_Channel_4 : \
												usartx == UART5 ? DMA_Channel_4 : \
												usartx == USART6 ? DMA_Channel_5 : \
												(int)0)
												
