903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/usart.c
#define	__usart_get_dma_flag(usartx)		(	usartx == USART1 ? DMA_FLAG_TCIF5 : \
												usartx == USART2 ? DMA_FLAG_TCIF5 : \
												usartx == USART3 ? DMA_FLAG_TCIF1 : \
												usartx == UART4 ? DMA_FLAG_TCIF2 : \
												usartx == UART5 ? DMA_FLAG_TCIF0 : \
												usartx == USART6 ? DMA_FLAG_TCIF1 : \
												(int)0)

#endif

#define MAX_USART_NUM			6									// 串口外设最大数量
#define MAX_RX_STRING_LENGTH	1024								// 接收文本数据包最大长度

static char gRxString[MAX_USART_NUM][MAX_RX_STRING_LENGTH];			// 接收文本数据包
static uint8_t gRxStringFlag[MAX_USART_NUM];						// 接收文本数据包标志位

/*USART私有数据结构体*/
typedef struct {
	uint8_t index;	// 索引
}USARTPrivData_t;

/* 函数声明 */
static int __usart_dma_recv_enable(USARTDev_t *pDev);
static int __usart_send_byte(USARTDev_t *pDev, uint8_t byte);
static int __usart_send_array(USARTDev_t *pDev, uint8_t *array, uint16_t length);
static int __usart_send_string(USARTDev_t *pDev, char *str);
static int __usart_send_number(USARTDev_t *pDev, uint32_t num, uint8_t length);
static int __usart_send_hex_packet(USARTDev_t *pDev, uint8_t *packet, uint8_t length, uint8_t head, uint8_t end);
static int __usart_printf(USARTDev_t *pDev, char *format, ...);
static char *__usart_recv_string(USARTDev_t *pDev);
static uint8_t __usart_recv_string_flag(USARTDev_t *pDev);
static int __usart_deinit(USARTDev_t *pDev);

/******************************************************************************
 * @brief	初始化USART
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/											
int usart_init(USARTDev_t *pDev)
{
	if (!pDev)
		return -1;
	
	/* 保存私有数据 */
	pDev->pPrivData = (USARTPrivData_t *)malloc(sizeof(USARTPrivData_t));
	if (!pDev->pPrivData)
		return -1;
	
	USARTPrivData_t *pPrivData = (USARTPrivData_t *)pDev->pPrivData;

	pPrivData->index = __usart_get_index(pDev->info.usartx);

	/* 配置时钟与GPIO */
	__usart_config_clock_enable(pDev->info.usartx);
	__usart_config_gpio_clock_enable(pDev->info.TXPort);
	__usart_config_gpio_clock_enable(pDev->info.RXPort);
	__usart_config_io_af_pp(pDev->info.TXPort, pDev->info.TXPin);
	__usart_config_io_af_pp(pDev->info.RXPort, pDev->info.RXPin);
	
	#if defined(STM32F40_41xxx)
	if (pDev->info.usartx == USART1)
	{
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);
	}
	else if (pDev->info.usartx == USART2)
	{
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
		GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);
	}
	else if (pDev->info.usartx == USART2)
	{
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_USART3);
		GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_USART3);
	}
	else if (pDev->info.usartx == UART4)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_UART4);
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_UART4);
	}
	else if (pDev->info.usartx == UART5)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_UART5);
		GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_UART5);
	}
	else if (pDev->info.usartx == USART6)
	{
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource6, GPIO_AF_USART6);
		GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_USART6);
	}
	#endif
	
	/* 配置USART */
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = pDev->info.baud;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_Init(pDev->info.usartx, &USART_InitStructure);
	
	/* 配置中断 */
	USART_ITConfig(pDev->info.usartx, USART_IT_RXNE, ENABLE);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = __usart_get_irqn(pDev->info.usartx);
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
	
	/* 开启USART */
	USART_Cmd(pDev->info.usartx, ENABLE);
	
	/* 函数指针赋值 */
	pDev->send_byte = __usart_send_byte;
	pDev->send_array = __usart_send_array;
	pDev->send_string = __usart_send_string;
	pDev->send_number = __usart_send_number;
	pDev->send_hex_packet = __usart_send_hex_packet;
	pDev->printf = __usart_printf;
	pDev->recv_string = __usart_recv_string;
	pDev->recv_string_flag = __usart_recv_string_flag;
	pDev->deinit = __usart_deinit;
	
	pDev->DMAFlag = false;
	pDev->initFlag = true;
	return 0;
}

/******************************************************************************
 * @brief	初始化USART并配置为DMA接收数据
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/											
int usart_dma_init(USARTDev_t *pDev)
{
	/* USART初始化 */
	usart_init(pDev);
	
	/* 保存私有数据 */
	USARTPrivData_t *pPrivData = (USARTPrivData_t *)pDev->pPrivData;
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	if (pDev->info.usartx == USART1)			{	pPrivData->DMAChannel = DMA1_Channel5;	}
	else if (pDev->info.usartx == USART2)	{	pPrivData->DMAChannel = DMA1_Channel6;	}
	else if (pDev->info.usartx == USART3)	{	pPrivData->DMAChannel = DMA1_Channel3;	}
	else if (pDev->info.usartx == UART4)		{	pPrivData->DMAChannel = DMA2_Channel3;	}
	else	{return -1;}

	/* 配置DMA */
	__usart_config_dma_clock_enable(pDev->info.usartx);
	DMA_InitTypeDef DMA_InitStructure;
	DMA_DeInit(pPrivData->DMAChannel);													// 将DMA的通道寄存器重设为缺省值
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&pDev->info.usartx->DR;		// DMA外设基地址
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)(gRxString[pPrivData->index]);		// DMA内存基地址
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;									// 数据传输方向，从外设读取发送到内存
	DMA_InitStructure.DMA_BufferSize = sizeof(gRxString[pPrivData->index]);				// DMA通道的DMA缓存的大小
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;					// 外设地址寄存器不变
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;								// 内存地址寄存器递增
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;				// 数据宽度为8位
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;						// 数据宽度为8位
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;										// 工作在正常模式，一次传输后自动结束
	DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;								// 中优先级 
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;										// 没有设置为内存到内存传输
	DMA_Init(pPrivData->DMAChannel, &DMA_InitStructure);

	/* 中断使能 */
	USART_ITConfig(pDev->info.usartx, USART_IT_RXNE, DISABLE);							// 关闭串口接受中断
	USART_ITConfig(pDev->info.usartx, USART_IT_IDLE, ENABLE);							// 使能USART空闲中断

	/* 开启DMA */
	DMA_Cmd(pPrivData->DMAChannel, ENABLE);

