903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/usart.c
	/* 启用USART的DMA请求 */
	USART_DMACmd(pDev->info.usartx, USART_DMAReq_Rx, ENABLE);

	#elif defined(STM32F40_41xxx)
	
	/* 配置DMA */
	__usart_config_dma_clock_enable(pDev->info.usartx);									// 开启DMA时钟
	DMA_DeInit(__usart_get_dma_stream(pDev->info.usartx));
	DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_Channel = __usart_get_dma_channel(pDev->info.usartx);			// 选择DMA通道
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&pDev->info.usartx->DR;		// DMA外设基地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)(gRxString[pPrivData->index]);	// DMA内存基地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;								// 从外设读取发送到内存
    DMA_InitStructure.DMA_BufferSize = sizeof(gRxString[pPrivData->index]);				// DMA通道的DMA缓存的大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;					// 外设地址不增
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;								// 内存地址自增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;				// 外设数据单位8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;						// 内存数据单位8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;										// 工作在正常模式，一次传输后自动结束
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;								// 优先级：中
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;								// 禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;						// FIFO阈值为满
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;							// 内存突发传输为单次
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;					// 外设突发传输为单次
    DMA_Init(__usart_get_dma_stream(pDev->info.usartx), &DMA_InitStructure);
					
	/* 中断使能 */
	USART_ITConfig(pDev->info.usartx, USART_IT_RXNE, DISABLE);							// 关闭串口接受中断
	USART_ITConfig(pDev->info.usartx, USART_IT_IDLE, ENABLE);							// 使能USART空闲中断

	/* 开启DMA */
    DMA_Cmd(__usart_get_dma_stream(pDev->info.usartx), ENABLE);

	/* 启用USART的DMA请求 */
	USART_DMACmd(pDev->info.usartx, USART_DMAReq_Rx, ENABLE);
	
	#endif
	
	/* 函数指针赋值 */
	pDev->dma_recv_enable = __usart_dma_recv_enable;
	
	pDev->DMAFlag = true;
	
	return 0;
}

/******************************************************************************
 * @brief	USART开启一次DMA接收
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_dma_recv_enable(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = (USARTPrivData_t *)pDev->pPrivData;
	
	if (!pDev || !pDev->initFlag || !pDev->DMAFlag)
		return -1;
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	/* 将接收的内存部分数据清0 */
	memset(gRxString[pPrivData->index], 0, sizeof(gRxString[pPrivData->index]));
	
	/* 重新设置传输数据长度 */
	DMA_SetCurrDataCounter(pPrivData->DMAChannel, sizeof(gRxString[pPrivData->index]));

	/* 重新打开DMA */
	DMA_Cmd(pPrivData->DMAChannel, ENABLE);
	
	#elif defined(STM32F40_41xxx)
	
	/* 将接收的内存部分数据清0 */
	memset(gRxString[pPrivData->index], 0, sizeof(gRxString[pPrivData->index]));

	/* 清除标志位 */
	DMA_ClearFlag(__usart_get_dma_stream(pDev->info.usartx), __usart_get_dma_flag(pDev->info.usartx));
	USART_ClearFlag(pDev->info.usartx, USART_FLAG_IDLE);

	/* 重新设置传输数据长度 */
	DMA_SetCurrDataCounter(__usart_get_dma_stream(pDev->info.usartx), sizeof(gRxString[pPrivData->index]));

	/* 重新打开DMA */
	DMA_Cmd(__usart_get_dma_stream(pDev->info.usartx), ENABLE);
	
	#endif

	return 0;
}

/******************************************************************************
 * @brief	USART发送一个字节
 * @param	pDev	:  USARTDev_t结构体指针
 * @param	byte	:  要发送的字节
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/	
static int __usart_send_byte(USARTDev_t *pDev, uint8_t byte)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	USART_SendData(pDev->info.usartx, byte);	// 写DR寄存器
	while (RESET == USART_GetFlagStatus(pDev->info.usartx, USART_FLAG_TXE));	// 等待TXE置1，不需要手动清除标志位
	
	return 0;
}

/******************************************************************************
 * @brief	USART发送一个数组
 * @param	pDev	:  USARTDev_t结构体指针
 * @param	array	:  要发送的数组首地址
 * @param	length	:  要发送的数组长度
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_send_array(USARTDev_t *pDev, uint8_t *array, uint16_t length)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	while (length--)
    {
        __usart_send_byte(pDev, *array++);
    }
	
	return 0;
}

/******************************************************************************
 * @brief	USART发送一个字符串
 * @param	pDev	:  USARTDev_t结构体指针
 * @param	str		:  要发送的字符串首地址
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_send_string(USARTDev_t *pDev, char *str)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	while (*str != '\0')
	{
		__usart_send_byte(pDev, *str++);
	}
	
	return 0;
}

/******************************************************************************
 * @brief	次方函数（USART发送一个数字用到）
 * @param	x
 * @param	y
 * @return	x^y
 ******************************************************************************/
static uint32_t pow(uint32_t x, uint8_t y)
{
	uint32_t res = 1;
	while (y--)
	{
		res *= x;
	}
	return res;
}

/******************************************************************************
 * @brief	USART发送一个数字
 * @param	pDev	:  USARTDev_t结构体指针
 * @param	num		:  要发送的数字
 * @param	length	:  要发送的数字长度
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_send_number(USARTDev_t *pDev, uint32_t num, uint8_t length)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	uint8_t i;
	for(i = 0;i < length;i++)
	{
		__usart_send_byte(pDev, num / pow(10, length - i - 1) % 10 + '0');
	}
	
	return 0;
}

/******************************************************************************
 * @brief	USART发送HEX数据包（0xFF为包头，0xFE为包尾）
 * @param	pDev	:  USARTDev_t结构体指针
 * @param	packet	:  要发送的HEX数据包首地址
 * @param	length	:  要发送的HEX数据包长度
 * @param	packet	:  要发送的HEX数据包头
 * @param	length	:  要发送的HEX数据包尾
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_send_hex_packet(USARTDev_t *pDev, uint8_t *packet, uint8_t length, uint8_t head, uint8_t end)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	__usart_send_byte(pDev, head);	//发送包头
	__usart_send_array(pDev, packet, length);	//发送数据包
	__usart_send_byte(pDev, end);	//发送包尾
	
