903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/usart.c
	return 0;
}

/******************************************************************************
 * @brief	printf重定义（仅USART1可用）
 ******************************************************************************/
int fputc(int ch, FILE *f)
{
	USART_SendData(USART1, ch);	// 写DR寄存器
	while (RESET == USART_GetFlagStatus(USART1, USART_FLAG_TXE));	// 等待TXE置1，不需要手动清除标志位
	return ch;
}

/******************************************************************************
 * @brief	printf函数封装（多个串口都可使用）
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_printf(USARTDev_t *pDev, char *format, ...)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	char str[100];
	va_list arg;
	va_start(arg, format);
	vsprintf(str, format, arg);
	va_end(arg);
	__usart_send_string(pDev, str);
	
	return 0;
}

/******************************************************************************
 * @brief	返回USART接收的文本数据包的首地址
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收的文本数据包的首地址
 ******************************************************************************/
static char *__usart_recv_string(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	return gRxString[pPrivData->index];
}

/******************************************************************************
 * @brief	返回USART接收的文本数据包标志位（并自动清除）
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收的文本数据包标志位
 ******************************************************************************/
static uint8_t __usart_recv_string_flag(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	if (gRxStringFlag[pPrivData->index] == 1)
	{
		gRxStringFlag[pPrivData->index] = 0;
		
		return 1;
	}
	return 0;
}

/******************************************************************************
 * @brief	去初始化USART
 * @param	pDev   :  USARTDev_t
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_deinit(USARTDev_t *pDev)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	/* 释放私有数据内存 */
	free(pDev->pPrivData);
    pDev->pPrivData = NULL;
	
	pDev->DMAFlag = false;	// 修改初始化标志
	pDev->initFlag = false;
	
	return 0;
}

/******************************************************************************
 * @brief	USART接收文本数据包中断回调函数
 * @param	usartx	：	串口外设
 * @return	无
 ******************************************************************************/
static void __usart_recv_string_callback(USARTx usartx)
{
	uint8_t index;
	if (usartx == USART1)		{index = 0;}
	else if (usartx == USART2)	{index = 1;}
	else if (usartx == USART3)	{index = 2;}
	else if (usartx == UART4)	{index = 3;}
	else if (usartx == UART5)	{index = 4;}
	else if (usartx == USART6)	{index = 5;}
	
	static uint8_t rx_string_num = 0; 						// 接收到文本数据包的数据个数
	
	uint8_t rx_byte = USART_ReceiveData(usartx);
	
	if (rx_string_num < (uint8_t)(sizeof(gRxString[index]) - 1)) 	// 确保不越界
	{
		gRxString[index][rx_string_num++] = rx_byte;
		if (rx_byte == '\n' && rx_string_num > 1 && gRxString[index][rx_string_num - 2] == '\r')	// 检查是否接收到完整的数据包
		{
            gRxString[index][rx_string_num - 2] = '\0'; // 结束符
            rx_string_num = 0; 							// 重置接收计数器
            gRxStringFlag[index] = 1; 					// 标记数据包已接收完成
		}
	}
	else
	{
		rx_string_num = 0;								// 如果接收到的数据超出了数组的大小，重置接收计数器
		gRxStringFlag[index] = 0;
	}
}

/******************************************************************************
 * @brief	USART1中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART1_IRQHandler(void)
{
	volatile uint8_t clear;
	
	if (USART_GetITStatus(USART1, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART1->SR;			// 清除空闲中断
			clear = USART1->DR;			// 清除空闲中断
			gRxStringFlag[0] = 1;		// 置接收标志位
		
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA1_Channel5, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA2_Stream5, DISABLE);
			#endif
	}
	
	if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
	{
		__usart_recv_string_callback(USART1);

		USART_ClearITPendingBit(USART1, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
 * @brief	USART2中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART2_IRQHandler(void)
{
	volatile uint8_t clear;
	
	if (USART_GetITStatus(USART2, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART2->SR;		// 清除空闲中断
			clear = USART2->DR;		// 清除空闲中断
			gRxStringFlag[1] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA1_Channel6, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA1_Stream5, DISABLE);
			#endif
	}

	if (USART_GetITStatus(USART2, USART_IT_RXNE) == SET)
	{
		__usart_recv_string_callback(USART2);
		
		USART_ClearITPendingBit(USART2, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
 * @brief	USART3中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART3_IRQHandler(void)
{
	volatile uint8_t clear;

	if (USART_GetITStatus(USART3, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART3->SR;		// 清除空闲中断
			clear = USART3->DR;		// 清除空闲中断
			gRxStringFlag[2] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA1_Channel3, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA1_Stream1, DISABLE);
			#endif
	}

	if (USART_GetITStatus(USART3, USART_IT_RXNE) == SET)
	{
		__usart_recv_string_callback(USART3);

		USART_ClearITPendingBit(USART3, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
 * @brief	UART4中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void UART4_IRQHandler(void)
{
	volatile uint8_t clear;

	if (USART_GetITStatus(UART4, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = UART4->SR;		// 清除空闲中断
			clear = UART4->DR;		// 清除空闲中断
			gRxStringFlag[3] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA2_Channel3, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA1_Stream2, DISABLE);
			#endif
	}

