903257958/stm32_oop_driver/mpu6050_i2c_sw_irq/driver/usart.c
	if (USART_GetITStatus(UART4, USART_IT_RXNE) == SET)
	{
		__usart_recv_string_callback(UART4);

		USART_ClearITPendingBit(UART4, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
* @brief	UART5中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void UART5_IRQHandler(void)
{
	#if defined(STM32F40_41xxx)
	volatile uint8_t clear;

	if (USART_GetITStatus(UART5, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = UART5->SR;		// 清除空闲中断
			clear = UART5->DR;		// 清除空闲中断
			gRxStringFlag[4] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			DMA_Cmd(DMA1_Stream0, DISABLE);
	}
	#endif
	
	if (USART_GetITStatus(UART5, USART_IT_RXNE) == SET)
	{
		__usart_recv_string_callback(UART5);

		USART_ClearITPendingBit(UART5, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
* @brief	UART6中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART6_IRQHandler(void)
{
	#if defined(STM32F40_41xxx)
	volatile uint8_t clear;

	if (USART_GetITStatus(USART6, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART6->SR;		// 清除空闲中断
			clear = USART6->DR;		// 清除空闲中断
			gRxStringFlag[5] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			DMA_Cmd(DMA1_Stream1, DISABLE);
	}
	
	if (USART_GetITStatus(USART6, USART_IT_RXNE) == SET)
	{
		__usart_recv_string_callback(USART6);

		USART_ClearITPendingBit(USART6, USART_IT_RXNE);	// 清除中断标志位
	}
	#endif
}
